In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [3]:
query = "select * from yellow_taxi_data limit 10;"
pd.read_sql(query, con = engine)

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1.0,2.10,1.0,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5,None
1,1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1.0,0.20,1.0,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0,None
2,2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1.0,14.70,1.0,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0,None
3,3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0.0,10.60,1.0,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0,None
4,4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1.0,4.94,1.0,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5,None
5,5,1,2021-01-01 00:16:29,2021-01-01 00:24:30,1.0,1.60,1.0,N,224,68,1,8.0,3.0,0.5,2.35,0.0,0.3,14.15,2.5,None
6,6,1,2021-01-01 00:00:28,2021-01-01 00:17:28,1.0,4.10,1.0,N,95,157,2,16.0,0.5,0.5,0.00,0.0,0.3,17.30,0.0,None
7,7,1,2021-01-01 00:12:29,2021-01-01 00:30:34,1.0,5.70,1.0,N,90,40,2,18.0,3.0,0.5,0.00,0.0,0.3,21.80,2.5,None
8,8,1,2021-01-01 00:39:16,2021-01-01 01:00:13,1.0,9.10,1.0,N,97,129,4,27.5,0.5,0.5,0.00,0.0,0.3,28.80,0.0,None
9,9,1,2021-01-01 00:26:12,2021-01-01 00:39:46,2.0,2.70,1.0,N,263,142,1,12.0,3.0,0.5,3.15,0.0,0.3,18.95,2.5,None

In [10]:
# How many taxi trips were there on January 15?
query = """select count(*)
from yellow_taxi_data
where cast(tpep_pickup_datetime as date) = '2021-01-15'
and cast(tpep_dropoff_datetime as date) = '2021-01-15'"""
pd.read_sql(query, con = engine)

   count
0  52768

In [11]:
# Consider only trips that started on January 15.
query = """select count(*)
from yellow_taxi_data
where cast(tpep_pickup_datetime as date) = '2021-01-15'"""
pd.read_sql(query, con = engine)

   count
0  53024

In [23]:
# Find the largest tip for each day. On which day it was the largest tip in January?
query = """select max(tip_amount), cast(tpep_pickup_datetime as date)
from yellow_taxi_data
group by cast(tpep_pickup_datetime as date)
order by max(tip_amount) desc
limit 10"""
pd.read_sql(query, con = engine)

       max tpep_pickup_datetime
0  1140.44           2021-01-20
1   696.48           2021-01-04
2   369.40           2021-01-03
3   250.00           2021-01-26
4   230.00           2021-01-09
5   200.80           2021-01-19
6   199.12           2021-01-30
7   192.61           2021-01-12
8   166.00           2021-01-21
9   158.00           2021-01-01

In [85]:
# What was the most popular destination for passengers picked up in central park on January 14?
query_1 = """select a."DOLocationID", count(*) n
from yellow_taxi_data a 
left join zones b on a."PULocationID" = b."LocationID"
where a."PULocationID" = 43
and cast(a.tpep_pickup_datetime as date) = '2021-01-14'
group by a."DOLocationID"
order by count(*) desc"""
query_2 = """select b."LocationID", b."Zone" from zones b"""
counts = pd.read_sql(query_1, con = engine)
zone_names = pd.read_sql(query_2, con = engine)
merged = counts.merge(zone_names, left_on = "DOLocationID", right_on = "LocationID")
merged[['Zone', 'n']]

                          Zone   n
0        Upper East Side South  97
1        Upper East Side North  94
2          Lincoln Square East  83
3        Upper West Side North  68
4        Upper West Side South  60
..                         ...  ..
72    Williamsbridge/Olinville   1
73             Windsor Terrace   1
74         Crown Heights South   1
75  Spuyten Duyvil/Kingsbridge   1
76                 Boerum Hill   1

[77 rows x 2 columns]

In [100]:
# What's the pickup-dropoff pair with the largest average price for a ride (calculated based on total_amount)?
query = """select d.pu_zone, d.do_zone, avg(d.total_amount)
from 
(select  b."Zone" pu_zone, c."Zone" do_zone, a.total_amount
from yellow_taxi_data a 
left join zones b on a."PULocationID" = b."LocationID" 
left join zones c on a."DOLocationID" = c."LocationID") d
group by d.pu_zone, d.do_zone
order by avg(d.total_amount) desc"""
pd.read_sql(query, con = engine)

                              pu_zone          do_zone       avg
0                       Alphabet City             None  2292.400
1                            Union Sq         Canarsie   262.852
2                          Ocean Hill             None   234.510
3      Long Island City/Hunters Point     Clinton East   207.610
4                         Boerum Hill         Woodside   200.300
...                               ...              ...       ...
27696  Long Island City/Hunters Point     Country Club     0.000
27697                 Lower East Side     North Corona    -7.000
27698         Briarwood/Jamaica Hills    Willets Point   -32.500
27699                    East Chelsea  Queensboro Hill   -43.800
27700    Penn Station/Madison Sq West     Howard Beach   -54.800

[27701 rows x 3 columns]